app/views/movies/index.html.haml

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date desc
---
  Include:
  - Movie.all_ratings.each do |rating|