app/controllers/movies_controller.rb

  def index
    @all_ratings = where_ratings
    @movies = Movie.order(sort_column + ' ' + sort_direction)
    @movies = @movies.where(rating:  @all_ratings )
---
SELECT "movies".* FROM "movies" WHERE "rating"."PG-13" = '1' ORDER BY title asc
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date desc

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "title" = 'Kill Bill', "updated_at" = '2013-11-02 01:26:41.310449' WHERE "movies"."id" = 2